# coding=utf-8
"""=================输入与输出========================="""
"""换行输出使用\,或使用（）[]{}"""

num1 = 1 \
       + 2 \
       + 3

num2 = (10
        + 20
        + 30)
print(num1, num2)
# 快捷键复制 ctrl+d
# 快捷键删除 ctrl+y
"""input()返回值是字符串"""
# a = input("请输入数字")
# b = 1
# print(int(a) + b)


# 特殊字符：具有特定的效果，如：\n 换行 \t 制表符 \r 回车
str2 = """\t今天是星期一吗?不是吧\n 我觉得是\r """
print(str2)

# 对于特殊字符，我们不想要他有特定的效果，只想按照原样输出，把特殊字符变成普通的字符来使用，可以用r/R或者斜杠（\）来处理
str3 = "今天是’星期三‘\n"
str4 = r"今天是’星期三‘\n"
str5 = "今天是\"星期三\""
print(str3, str4 + '\n', str5)

# 布尔型，非0即为真
b = 99999999
print(bool(b))
# 字符串的float不能直接转换成int
str1 = "3.1444444444"
print(int(float(str1)))

# 字符串转布尔型，空字符串转为布尔值为False，非空字符串永远为True
str = ""
str1 = "only"
print(bool(str), bool(str1))

"""===================变量赋值=================="""
"""多个变量连续定义与赋值,多个变量获得同一个初始值"""
a = b = c = 10
print(a, b, c)
print(id(a), id(b), id(c))

"""多个变量连续定义与赋值,多个变量分别获取不同的初始值"""
c, d, e = 3, 2, 1
print(c, d, e)
print(id(c), id(d), id(e))

"""回收机制，一个变量接受多个值 使用*接收"""

*a, b, c = 1, 2, 3, 4, 5, 6
print(a, b, c)
print(type(a), type(b))

"""格式化输出"""
# 方式一：使用 %d %s %f 来进行占位，具体显示什么值，我们来决定
# %d == 整数
# %s == 字符串
# %f == 小数
print("""
       =======自我介绍======
       name: %s,
       age: %d,
       addr: %s,
       sal: %f
       """ % ("lily", 18, "shenyang", 500.55))

# 方式二 ,str.format() 格式化输出
print("""
       =======自我介绍======
       name: {},
       age: {},
       addr: {},
       sal: {}
       """.format("lily", 18, "shenyang", 500.55))

"""
烤鸭店利润计算器
计算这个烤鸭店每天的利润是多少？ -- 怎么计算？
收入 - 成本 = 利润
进货价  售卖价  鸭子数量
利润 = （售卖价 - 成本价） * 鸭子数量
1.提示界面友好
2.让老板自己输入价格，鸭子数量
"""

print("--->欢迎使用烤鸭店计算器<---")
price1 = int(input("请输入你的进货价："))  # input传递出来的值，都是str！！！
price2 = int(input("请输入你的售卖价："))
num1 = int(input("请输入鸭子数量："))

result = (price2 - price1) * num1
print("今天获得的总利润为: {} 元".format(result))
